#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

        name                                       = "MoH User Management"
        # (25 unchanged attributes hidden)
    }

  # module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT-SERVICE.keycloak_openid_client.CLIENT has changed
  ~ resource "keycloak_openid_client" "CLIENT" {
      + extra_config                               = {}
        id                                         = "4c3b3184-cee7-4825-b70a-43800722284c"
        # (26 unchanged attributes hidden)
    }

  # module.COMMON_SSO_DEV.module.ISB.module.WEBCAPS-USER-ADMIN.keycloak_group.GROUP has changed
  ~ resource "keycloak_group" "GROUP" {
      + attributes = {}
        id         = "cfe2f280-66a8-4c8a-98f9-1c64e48b68f5"
        name       = "WebCAPS User Admin"
        # (2 unchanged attributes hidden)
    }

  # module.COMMON_SSO_DEV.module.ISB.module.terraform.keycloak_openid_client.CLIENT has changed
  ~ resource "keycloak_openid_client" "CLIENT" {
      + extra_config                               = {}
        id                                         = "84979a59-9733-40b1-bc29-cd6d14cebe95"
        # (24 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.COMMON_SSO_DEV.module.ISB.module.azure.keycloak_oidc_identity_provider.this will be updated in-place
  ~ resource "keycloak_oidc_identity_provider" "this" {
      ~ extra_config                            = {
          + "forwardParameters" = ""
          + "tooltip"           = ""
            # (1 unchanged element hidden)
        }
        id                                      = "azure"
        # (25 unchanged attributes hidden)
    }

  # module.COMMON_SSO_DEV.module.ISB.module.TOMCAT-CLIENT.module.TOMCAT_OIDC_CLIENT.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = "CONFIDENTIAL"
      + admin_url                                  = (known after apply)
      + backchannel_logout_revoke_offline_sessions = false
      + backchannel_logout_session_required        = true
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = "client-secret"
      + client_id                                  = "tomcat-client"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = false
      + consent_screen_text                        = (known after apply)
      + description                                = "Tomcat OIDC Client for ORDS"
      + direct_access_grants_enabled               = false
      + display_on_consent_screen                  = (known after apply)
      + enabled                                    = true
      + exclude_session_state_from_auth_response   = false
      + frontchannel_logout_enabled                = (known after apply)
      + full_scope_allowed                         = false
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = false
      + import                                     = false
      + name                                       = "tomcat-client"
      + oauth2_device_authorization_grant_enabled  = false
      + realm_id                                   = "ISB"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = false
      + standard_flow_enabled                      = false
      + use_refresh_tokens                         = true
      + use_refresh_tokens_client_credentials      = false
      + valid_post_logout_redirect_uris            = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sookeke, Action: `pull_request`*